/**/

l="rmh.library";if ~show("L",l) then;if ~addlib(l,0,-30) then exit

say '       ProgramName():' ProgramName()
say ' ProgramName("Full"):' ProgramName("Full")
say 'ProgramName("NoExt"):' ProgramName("NoExt")
say ' ProgramName("Path"):' ProgramName("Path")
